; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 602524 2 1 2 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Star5 spectrograph1)
	(have_image Planet6 image0)
	(have_image Phenomenon7 image0)
	(have_image Planet8 image0)
	(have_image Phenomenon9 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite1 planet6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet6)
   goals met: 0 of 6
6. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   goals met: 0 of 6
7. (turn_to satellite1 phenomenon9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 6
8. (take_image satellite0 star5 instrument0 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 1 of 6
9. (turn_to satellite1 planet6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet6)
   goals met: 1 of 6
10. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 1 of 6
11. (turn_to satellite1 phenomenon9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 6
12. (take_image satellite0 planet8 instrument0 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 6
13. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 6
14. (turn_to satellite0 planet6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet6)
   goals met: 2 of 6
15. (turn_to satellite1 phenomenon9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 6
16. (take_image satellite0 planet6 instrument0 image0)
   added: (have_image planet6 image0)
   goals met: 3 of 6
17. (turn_to satellite1 star4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star4)
   goals met: 3 of 6
18. (turn_to satellite0 phenomenon7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 6
19. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 3 of 6
20. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   goals met: 4 of 6
21. (turn_to satellite1 phenomenon9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 6
22. (turn_to satellite0 groundstation1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation1)
   goals met: 5 of 6
23. (take_image satellite1 phenomenon9 instrument1 image0)
   added: (have_image phenomenon9 image0)
   goals met: 6 of 6
